### Pandas 시작- 파일을 DataFrame 로딩, 기본 API

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.4.4'

**read_csv()**

read_csv()를 이용하여 csv파일을 편리하게 DataFrame으로 로딩합니다. 
read_csv()의 sep인자를 콤마(,)가 아닌 다른 분리자로 변경하여 다른 유형의 파일도 로드가 가능합니다.

In [3]:
titanic_df = pd.read_csv('train.csv')
print('titanic 변수 type:',type(titanic_df))

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

**head()와 tail()**

head()는 DataFrame의 맨 앞부터 일부 데이터만 추출합니다.
tail()은 DataFrame의 맨 뒤부터 일부 데이터만 추출합니다.

In [4]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
titanic_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
display(titanic_df.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**DataFrame 출력 시 option**

In [7]:
display(titanic_df.tail(3))
display(titanic_df.head(3))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [8]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 데이터프레임 display 추가옵션세팅

In [9]:
pd.set_option('display.max_rows', 1000) #1000개의 row 출력
pd.set_option('display.max_colwidth', 100) #column값 너비가 최대 100자까지 한줄에 출력
pd.set_option('display.max_columns', 100) #column수 최대 100개까지

#titanic_df

**df.shape**

DataFrame의 행(Row)와 열(Column) 크기를 가지고 있는 속성입니다.

In [10]:
print('DataFrame 크기: ', titanic_df.shape)

DataFrame 크기:  (891, 12)

**DataFrame의 컬럼명과 인덱스 추출방법**

In [10]:
print("columns:",titanic_df.columns)
print("index:",titanic_df.index)
print("index value:", titanic_df.index.values)

columns: Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
index: RangeIndex(start=0, stop=891, step=1)
index value: [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

**info()**

DataFrame내의 컬럼명, 데이터 타입, Null건수, 데이터 건수 정보를 제공합니다.

In [13]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**describe()**

데이터값들의 평균,표준편차,4분위 분포도를 제공합니다. 숫자형 컬럼들에 대해서 해당 정보를 제공합니다.

In [14]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

**value_counts()**

- 동일한 개별 데이터 값이 몇건이 있는지 정보를 제공합니다. 즉 개별 데이터값의 분포도를 제공합니다. value_counts()는 과거에는 Series객체에서만 호출 될 수 있었지만 현재에는 DataFram에서도 호출가능합니다. 

- value_counts() 메소드를 사용할 때는 Null 값을 무시하고 결과값을 내놓기 쉽습니다. value_counts()는 Null값을 포함하여 개별 데이터 값의 건수를 계산할지 여부를 dropna 인자로 판단합니다. dropna는 디폴트로 True이며 이 경우는 Null값을 무시하고 개별 데이터 값의 건수를 계산합니다.

In [15]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
titanic_df['Pclass'].head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [17]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

In [12]:
print('titanic_df 데이터 건수:', titanic_df.shape[0])
print('기본 설정인 dropna=True로 value_counts()')
# value_counts()는 디폴트로 dropna=True 이므로 value_counts(dropna=True)와 동일. 
print(titanic_df['Embarked'].value_counts())
print(titanic_df['Embarked'].value_counts(dropna=False))

titanic_df 데이터 건수: 891
기본 설정인 dropna=True로 value_counts()
S    644
C    168
Q     77
Name: Embarked, dtype: int64
S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [19]:
# DataFrame에서도 value_counts() 적용 가능. 
titanic_df[['Pclass', 'Embarked']].value_counts()

Pclass  Embarked
3       S           353
2       S           164
1       S           127
        C            85
3       Q            72
        C            66
2       C            17
        Q             3
1       Q             2
dtype: int64

* 넘파이, 판다스 자료구조들 관계
    * DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

In [23]:
# DataFrame을 ndarray로 변환
array3 = df_dict.values
print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]

In [24]:
# DataFrame을 리스트로 변환
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

# DataFrame을 딕셔너리로 변환
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

 df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

-----------
## DataFrame 내 데이터 Create & Update

### DataFrame의 칼럼 데이터 세트 생성과 수정

- 칼럼 생성

In [25]:
titanic_df['Age_0']=0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

- 수정

In [26]:
titanic_df['Age_by_10'] = titanic_df['Age']*10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch']+1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [27]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

### DataFrame 데이터 삭제(Delete)

* axis에 따른 삭제**
    * axis=0 =>row데이터 삭제
    * axis=1 =>column데이터 삭제

In [28]:
titanic_drop_df = titanic_df.drop('Age_0', axis=1 ) #Age_0 컬럼을 모두삭제
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

In [29]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

- 여러개의 컬럼들의 삭제는 drop의 인자로 삭제 컬럼들을 리스트로 입력. inplace=True일 경우 호출을 한 DataFrame에 drop결과가 반영됩니다. 이때 반환값은 None입니다.

In [30]:
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True) #inplace인자에 True값을 줘야 삭제된 데이터프레임이 반영된다.
print(' inplace=True 로 drop 후 반환된 값:',drop_result)
titanic_df.head(3)

 inplace=True 로 drop 후 반환된 값: None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

axis=0 일 경우 drop()은 row 방향으로 데이터를 삭제합니다.

In [31]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(6))

titanic_df.drop([0,1,2], axis=0, inplace=True) #index번호 순으로 0번째 1번째 2번째 row 제거

print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
3            4         1       1  Futrelle, M...  female  35.0      1      0          113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0          330877   8.4583   NaN        Q
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

In [32]:
titanic_df = titanic_df.drop('Fare', axis=1, inplace=False)
titanic_df.head()

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   NaN        Q
6            7         0       1  McCarthy, M...    male  54.0      0      0   17463   E46        S
7            8         0       3  Palsson, Ma...    male   2.0      3      1  349909   NaN        S

-----------------

### Index 객체

In [33]:
# 원본 파일 재 로딩 
titanic_df = pd.read_csv('titanic_train.csv')
# Index 객체 추출
indexes = titanic_df.index
print(indexes)
# Index 객체를 실제 값 arrray로 변환 
print('Index 객체 array값:\n',indexes.values)

RangeIndex(start=0, stop=891, step=1)
Index 객체 array값:
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [34]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [35]:
indexes[0] = 5

TypeError: Index does not support mutable operations

In [ ]:
series_fair = titanic_df['Fare']
series_fair

In [36]:
series_fair = titanic_df['Fare']
print('Fair Series max 값:', series_fair.max()) #series타입에 적용가능한 max(), sum()적용
print('Fair Series sum 값:', series_fair.sum())
print('sum() Fair Series:', sum(series_fair))
print('Fair Series + 3:\n',(series_fair + 3).head(3) )

Fair Series max 값: 512.3292
Fair Series sum 값: 28693.9493
sum() Fair Series: 28693.949299999967
Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [37]:
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

**인덱스값을 reset ->reset_default 0,1,2,3...**

In [38]:
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [40]:
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체 변수 타입과 shape:',type(value_counts), value_counts.shape)

new_value_counts_01 = value_counts.reset_index(inplace=False)
print('### After reset_index ###')
print(new_value_counts_01)
print('new_value_counts_01 객체 변수 타입과 shape:',type(new_value_counts_01), new_value_counts_01.shape)

new_value_counts_02 = value_counts.reset_index(drop=True, inplace=False)
print('### After reset_index with drop ###')
print(new_value_counts_02)
print('new_value_counts_02 객체 변수 타입과 shape:',type(new_value_counts_02), new_value_counts_02.shape)

### before reset_index ###
3    491
1    216
2    184
Name: Pclass, dtype: int64
value_counts 객체 변수 타입과 shape: <class 'pandas.core.series.Series'> (3,)
### After reset_index ###
   index  Pclass
0      3     491
1      1     216
2      2     184
new_value_counts_01 객체 변수 타입과 shape: <class 'pandas.core.frame.DataFrame'> (3, 2)
### After reset_index with drop ###
0    491
1    216
2    184
Name: Pclass, dtype: int64
new_value_counts_02 객체 변수 타입과 shape: <class 'pandas.core.series.Series'> (3,)

In [41]:
titanic_df['Pclass'].value_counts().reset_index()

   index  Pclass
0      3     491
1      1     216
2      2     184

In [42]:
# DataFrame의 rename()은 인자로 columns를 dictionary 형태로 받으면 '기존 컬럼명':'신규 컬럼명' 형태로 변환
new_value_counts_01 = titanic_df['Pclass'].value_counts().reset_index()
new_value_counts_01.rename(columns={'index':'Pclass', 'Pclass':'Pclass_count'})

   Pclass  Pclass_count
0       3           491
1       1           216
2       2           184

### DataFrame 인덱싱 및 필터링

* DataFrame의 [ ] 연산자

In [43]:
# DataFrame객체에서 []연산자내에 한개의 컬럼만 입력하면 Series 객체를 반환  
series = titanic_df['Name']
print(series.head(3))
print("## type:",type(series), 'shape:', series.shape)

# DataFrame객체에서 []연산자내에 여러개의 컬럼을 리스트로 입력하면 그 컬럼들로 구성된 DataFrame 반환  
filtered_df = titanic_df[['Name', 'Age']]
display(filtered_df.head(3))
print("## type:", type(filtered_df), 'shape:', filtered_df.shape)

# DataFrame객체에서 []연산자내에 한개의 컬럼을 리스트로 입력하면 한개의 컬럼으로 구성된 DataFrame 반환 
one_col_df = titanic_df[['Name']]
display(one_col_df.head(3))
print("## type:", type(one_col_df), 'shape:', one_col_df.shape)

0    Braund, Mr....
1    Cumings, Mr...
2    Heikkinen, ...
Name: Name, dtype: object
## type: <class 'pandas.core.series.Series'> shape: (891,)

             Name   Age
0  Braund, Mr....  22.0
1  Cumings, Mr...  38.0
2  Heikkinen, ...  26.0

## type: <class 'pandas.core.frame.DataFrame'> shape: (891, 2)

             Name
0  Braund, Mr....
1  Cumings, Mr...
2  Heikkinen, ...

## type: <class 'pandas.core.frame.DataFrame'> shape: (891, 1)

In [44]:
print('[ ] 안에 숫자 index는 KeyError 오류 발생:\n', titanic_df[0])

KeyError: 0

In [45]:
titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

In [46]:
titanic_df[ titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

* DataFrame iloc[] 연산자

In [47]:
data = {'Name': ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one','two','three','four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [48]:
data_df.iloc[0, 0]

'Chulmin'

In [49]:
# 아래 코드는 오류를 발생합니다. 
data_df.iloc[0, 'Name']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [50]:
# 아래 코드는 오류를 발생합니다. 
data_df.iloc['one', 0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [51]:
print("\n iloc[1, 0] 두번째 행의 첫번째 열 값:", data_df.iloc[1,0])
print("\n iloc[2, 1] 세번째 행의 두번째 열 값:", data_df.iloc[2,1])

print("\n iloc[0:2, [0,1]] 첫번째에서 두번째 행의 첫번째, 두번째 열 값:\n", data_df.iloc[0:2, [0,1]])
print("\n iloc[0:2, 0:3] 첫번째에서 두번째 행의 첫번째부터 세번째 열값:\n", data_df.iloc[0:2, 0:3])

print("\n 모든 데이터 [:] \n", data_df.iloc[:])
print("\n 모든 데이터 [:, :] \n", data_df.iloc[:, :])

 iloc[1, 0] 두번째 행의 첫번째 열 값: Eunkyung

 iloc[2, 1] 세번째 행의 두번째 열 값: 2015

 iloc[0:2, [0,1]] 첫번째에서 두번째 행의 첫번째, 두번째 열 값:
          Name  Year
one   Chulmin  2011
two  Eunkyung  2016

 iloc[0:2, 0:3] 첫번째에서 두번째 행의 첫번째부터 세번째 열값:
          Name  Year  Gender
one   Chulmin  2011    Male
two  Eunkyung  2016  Female

 모든 데이터 [:]
            Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

 모든 데이터 [:, :]
            Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [52]:
print("\n 맨 마지막 칼럼 데이터 [:, -1] \n", data_df.iloc[:, -1])
print("\n 맨 마지막 칼럼을 제외한 모든 데이터 [:, :-1] \n", data_df.iloc[:, :-1])

 맨 마지막 칼럼 데이터 [:, -1]
 one        Male
two      Female
three      Male
four       Male
Name: Gender, dtype: object

 맨 마지막 칼럼을 제외한 모든 데이터 [:, :-1]
            Name  Year
one     Chulmin  2011
two    Eunkyung  2016
three  Jinwoong  2015
four    Soobeom  2015

In [53]:
# iloc[]는 불린 인덱싱을 지원하지 않아서 아래는 오류를 발생.
print("\n ix[data_df.Year >= 2014] \n", data_df.iloc[data_df.Year >= 2014])

ValueError: iLocation based boolean indexing cannot use an indexable as a mask

* DataFrame loc[ ] 연산자

In [54]:
data_df.loc['one', 'Name']

'Chulmin'

In [55]:
# 다음 코드는 오류를 발생합니다. 
data_df.loc[0, 'Name']

KeyError: 0

In [56]:
print('위치기반 iloc slicing\n', data_df.iloc[0:1, 0],'\n')
print('명칭기반 loc slicing\n', data_df.loc['one':'two', 'Name'])

위치기반 iloc slicing
 one    Chulmin
Name: Name, dtype: object

명칭기반 loc slicing
 one     Chulmin
two    Eunkyung
Name: Name, dtype: object

In [57]:
print('인덱스 값 three인 행의 Name칼럼값:', data_df.loc['three', 'Name'])
print('\n인덱스 값 one 부터 two까지 행의 Name과 Year 칼럼값:\n', data_df.loc['one':'two', ['Name', 'Year']])
print('\n인덱스 값 one 부터 three까지 행의 Name부터 Gender까지의 칼럼값:\n', data_df.loc['one':'three', 'Name':'Gender'])
print('\n모든 데이터 값:\n', data_df.loc[:])
print('\n불린 인덱싱:\n', data_df.loc[data_df.Year >= 2014])

인덱스 값 three인 행의 Name칼럼값: Jinwoong

인덱스 값 one 부터 two까지 행의 Name과 Year 칼럼값:
          Name  Year
one   Chulmin  2011
two  Eunkyung  2016

인덱스 값 one 부터 three까지 행의 Name부터 Gender까지의 칼럼값:
            Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male

모든 데이터 값:
            Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

불린 인덱싱:
            Name  Year  Gender
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

* 불린 인덱싱

In [58]:
pd.set_option('display.max_colwidth', 200)
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass                                       Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2                      Wheadon, Mr. Edward H    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1             Ostby, Mr. Engelhart Cornelius    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1                  Goldschmidt, Mr. George B    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3                       Connors, Mr. Patrick    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1                  Van der hoef, Mr. Wyckoff    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1                  Stead, Mr. William Thomas    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1          Andrews, Miss. Kornelia Theodosia  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3                           Duane, Mr. Frank    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3                  Nysveen, Mr. Johan Hansen    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1                          Fortune, Mr. Mark    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1                  Millet, Mr. Francis Davis    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3                     Turkula, Mrs. (Hedwig)  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1                    Artagaveytia, Mr. Ramon    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1               Nicholson, Mr. Arthur Ernest    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1                         Wright, Mr. George    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2                         Harris, Mr. George    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1                      Sutton, Mr. Frederick    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1       Barkworth, Mr. Algernon Henry Wilson    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2                Mitchell, Mr. Henry Michael    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1               Crosby, Capt. Edward Gifford    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3                        Svensson, Mr. Johan    male  74.0      0      0       347060    7.7750          NaN        S

In [59]:
titanic_df[titanic_df['Age'] > 60][['Name','Age']].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [60]:
titanic_df.loc[titanic_df['Age'] > 60, ['Name','Age']].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [61]:
titanic_df[ (titanic_df['Age'] > 60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]

     PassengerId  Survived  Pclass                                       Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1          Andrews, Miss. Kornelia Theodosia  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)  female  62.0      0      0  113572  80.0000   B28      NaN

In [62]:
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass']==1
cond3 = titanic_df['Sex']=='female'
titanic_df[ cond1 & cond2 & cond3]

     PassengerId  Survived  Pclass                                       Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1          Andrews, Miss. Kornelia Theodosia  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)  female  62.0      0      0  113572  80.0000   B28      NaN

### 정렬, Aggregation함수, GroupBy 적용

* DataFrame, Series의 정렬 - sort_values()

In [63]:
# 이름으로 정렬
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass                              Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3               Abbing, Mr. Anthony    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3       Abbott, Mr. Rossmore Edward    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs. Stanton (Rosa Hunt)  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [64]:
# Pclass와 Name으로 내림차순 정렬
titanic_sorted = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass                             Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3      van Melkebeke, Mr. Philemon  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiard, Mr. Austin Blyler  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3        de Pelsmaeker, Mr. Alfons  male  16.0      0      0    345778   9.5   NaN        S

* Aggregation 함수 적용

In [65]:
# DataFrame의 건수를 알고 싶다면 count() 보다는 shape를 이용 
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

특정 컬럼들로 aggregation 수행.

In [66]:
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [67]:
titanic_df[['Age', 'Fare']].sum()

Age     21205.1700
Fare    28693.9493
dtype: float64

In [68]:
titanic_df[['Age', 'Fare']].count()

Age     714
Fare    891
dtype: int64

* groupby() 이용하기

groupby()내에 인자로 by를 Group by 하고자 하는 컬럼을 입력. 여러개의 컬럼으로 Group by 하고자 하면 []내에 컬럼명을 입력  

DataFrame에 groupby()를 호출하면 DataFrameGroupBy 객체를 반환

In [69]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [70]:
titanic_groupby[['Age', 'Fare']]

In [71]:
titanic_groupby[['Age', 'Fare']].count()

        Age  Fare
Pclass
1       186   216
2       173   184
3       355   491

In [72]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

In [73]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

서로 다른 aggregation을 적용하려면 서로 다른 aggregation 메소드를 호출해야 함. 이 경우 aggregation메소드가 많아지면 코드 작성이 번거로워 지므로 DataFrameGroupby의 agg()를 활용

In [74]:
titanic_df.groupby('Pclass')['Age'].max(), titanic_df.groupby('Pclass')['Age'].min()

(Pclass
 1    80.0
 2    70.0
 3    74.0
 Name: Age, dtype: float64,
 Pclass
 1    0.92
 2    0.67
 3    0.42
 Name: Age, dtype: float64)

In [75]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

서로 다른 컬럼에 서로 다른 aggregation 메소드를 적용할 경우 agg()내에 컬럼과 적용할 메소드를 Dict형태로 입력

In [76]:
agg_format={'Age':'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

**agg내의 인자로 들어가는 Dict객체에 동일한 Key값을 가지는 두개의 value가 있을 경우 마지막 value로 update됨**

즉 동일 컬럼에 서로 다른 aggregation을 가지면서 추가적인 컬럼 aggregation이 있을 경우 원하는 결과로 출력되지 않음.

In [77]:
agg_format={'Age':'max', 'Age':'mean', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

              Age       Fare
Pclass
1       38.233441  84.154687
2       29.877630  20.662183
3       25.140620  13.675550

In [78]:
titanic_df.groupby(['Pclass']).agg(age_max=('Age', 'max'), age_mean=('Age', 'mean'), fare_mean=('Fare', 'mean'))

        age_max   age_mean  fare_mean
Pclass
1          80.0  38.233441  84.154687
2          70.0  29.877630  20.662183
3          74.0  25.140620  13.675550

In [79]:
titanic_df.groupby('Pclass').agg(
    age_max=pd.NamedAgg(column='Age', aggfunc='max'),
    age_mean=pd.NamedAgg(column='Age', aggfunc='mean'), 
    fare_mean=pd.NamedAgg(column='Fare', aggfunc='mean')
)

        age_max   age_mean  fare_mean
Pclass
1          80.0  38.233441  84.154687
2          70.0  29.877630  20.662183
3          74.0  25.140620  13.675550

### 결손 데이터 처리하기
* isna()로 결손 데이터 여부 확인

In [80]:
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [81]:
titanic_df.isna( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

* fillna( ) 로 Missing 데이터 대체하기

In [82]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass                                                 Name     Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0            1         0       3                              Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0      1      0          PC 17599  71.2833   C85        C
2            3         1       3                               Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250  C000        S

In [83]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### nunique로 컬럼내 몇건의 고유값이 있는지 파악

In [88]:
print(titanic_df['Name'].value_counts())

Braund, Mr. Owen Harris                                                               1
Boulos, Mr. Hanna                                                                     1
Frolicher-Stehli, Mr. Maxmillian                                                      1
Gilinski, Mr. Eliezer                                                                 1
Murdlin, Mr. Joseph                                                                   1
Rintamaki, Mr. Matti                                                                  1
Stephenson, Mrs. Walter Bertram (Martha Eustis)                                       1
Elsbury, Mr. William James                                                            1
Bourke, Miss. Mary                                                                    1
Chapman, Mr. John Henry                                                               1
Van Impe, Mr. Jean Baptiste                                                           1
Leitch, Miss. Jessie Wills                                                            1
Johnson, Mr. Alfred                                                                   1
Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")                                          1
Taussig, Miss. Ruth                                                                   1
Jacobsohn, Mrs. Sidney Samuel (Amy Frances Christy)                                   1
Slabenoff, Mr. Petco                                                                  1
Harrington, Mr. Charles H                                                             1
Torber, Mr. Ernst William                                                             1
Homer, Mr. Harry ("Mr E Haven")                                                       1
Lindell, Mr. Edvard Bengtsson                                                         1
Karaic, Mr. Milan                                                                     1
Daniel, Mr. Robert Williams                                                           1
Laroche, Mrs. Joseph (Juliette Marie Louise Lafargue)                                 1
Shutes, Miss. Elizabeth W                                                             1
Andersson, Mrs. Anders Johan (Alfrida Konstantia Brogren)                             1
Jarvis, Mr. John Denzil                                                               1
Paulner, Mr. Uscher                                                                   1
Murphy, Miss. Margaret Jane                                                           1
Harris, Mr. George                                                                    1
de Messemaeker, Mrs. Guillaume Joseph (Emma)                                          1
Morrow, Mr. Thomas Rowan                                                              1
Sivic, Mr. Husein                                                                     1
Norman, Mr. Robert Douglas                                                            1
Simmons, Mr. John                                                                     1
Meanwell, Miss. (Marion Ogden)                                                        1
Davies, Mr. Alfred J                                                                  1
Stoytcheff, Mr. Ilia                                                                  1
Palsson, Mrs. Nils (Alma Cornelia Berglund)                                           1
Doharr, Mr. Tannous                                                                   1
Jonsson, Mr. Carl                                                                     1
Appleton, Mrs. Edward Dale (Charlotte Lamson)                                         1
Ross, Mr. John Hugo                                                                   1
Flynn, Mr. John Irwin ("Irving")                                                      1
Kelly, Miss. Mary                                                                     1
Rush, Mr. Alfred George John                                                          1
Patchett, Mr. George                                                                  1
Garside, Miss. Ethel                                                                  1
Silvey, Mrs. William Baird (Alice Munger)                                             1
Caram, Mrs. Joseph (Maria Elias)                                                      1
Jussila, Mr. Eiriik                                                                   1
Christy, Miss. Julie Rachel                                                           1
Thayer, Mrs. John Borland (Marian Longstreth Morris)                                  1
Downton, Mr. William James                                                            1
Jardin, Mr. Jose Neto                                                                 1
Horgan, Mr. John                                                                      1
Cook, Mr. Jacob                                                                       1
Hegarty, Miss. Hanora "Nora"                                                          1
Foo, Mr. Choong                                                                       1
Baclini, Miss. Eugenie                                                                1
Harper, Mr. Henry Sleeper                                                             1
Cor, Mr. Liudevit                                                                     1
Simonius-Blumer, Col. Oberst Alfons                                                   1
Willey, Mr. Edward                                                                    1
Stanley, Miss. Amy Zillah Elsie                                                       1
Mitkoff, Mr. Mito                                                                     1
Doling, Miss. Elsie                                                                   1
Kalvik, Mr. Johannes Halvorsen                                                        1
O'Leary, Miss. Hanora "Norah"                                                         1
Hickman, Mr. Leonard Mark                                                             1
Sagesser, Mlle. Emma                                                                  1
Radeff, Mr. Alexander                                                                 1
Bourke, Mrs. John (Catherine)                                                         1
Eitemiller, Mr. George Floyd                                                          1
Newell, Mr. Arthur Webster                                                            1
Frauenthal, Dr. Henry William                                                         1
Badt, Mr. Mohamed                                                                     1
Colley, Mr. Edward Pomeroy                                                            1
Coleff, Mr. Peju                                                                      1
Lindqvist, Mr. Eino William                                                           1
Hickman, Mr. Lewis                                                                    1
Butler, Mr. Reginald Fenton                                                           1
Skoog, Miss. Margit Elizabeth                                                         1
Jensen, Mr. Hans Peder                                                                1
Brocklebank, Mr. William Alfred                                                       1
Kirkland, Rev. Charles Leonard                                                        1
Herman, Miss. Alice                                                                   1
Danbom, Mr. Ernst Gilbert                                                             1
Lobb, Mrs. William Arthur (Cordelia K Stanlick)                                       1
Becker, Miss. Marion Louise                                                           1
Gavey, Mr. Lawrence                                                                   1
Yasbeck, Mr. Antoni                                                                   1
Kimball, Mr. Edwin Nelson Jr                                                          1
Nakid, Mr. Sahid                                                                      1
Hansen, Mr. Henry Damsgaard                                                           1
Bowen, Mr. David John "Dai"                                                           1
Sutton, Mr. Frederick                                                                 1
Longley, Miss. Gretchen Fiske                                                         1
Thorneycroft, Mr. Percival                                                            1
Bostandyeff, Mr. Guentcho                                                             1
O'Connell, Mr. Patrick D                                                              1
Barkworth, Mr. Algernon Henry Wilson                                                  1
Lundahl, Mr. Johan Svensson                                                           1
Stahelin-Maeglin, Dr. Max                                                             1
Parr, Mr. William Henry Marsh                                                         1
Skoog, Miss. Mabel                                                                    1
Davis, Miss. Mary                                                                     1
Leinonen, Mr. Antti Gustaf                                                            1
Collyer, Mr. Harvey                                                                   1
Panula, Mrs. Juha (Maria Emilia Ojala)                                                1
Taussig, Mrs. Emil (Tillie Mandelbaum)                                                1
Robbins, Mr. Victor                                                                   1
Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")                     1
Kent, Mr. Edward Austin                                                               1
Renouf, Mr. Peter Henry                                                               1
Braund, Mr. Lewis Richard                                                             1
Karlsson, Mr. Nils August                                                             1
Hirvonen, Miss. Hildur E                                                              1
Goodwin, Master. Harold Victor                                                        1
Frost, Mr. Anthony Wood "Archie"                                                      1
Rouse, Mr. Richard Henry                                                              1
Turkula, Mrs. (Hedwig)                                                                1
Bishop, Mr. Dickinson H                                                               1
Lefebre, Miss. Jeannie                                                                1
Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)                                       1
Somerton, Mr. Francis William                                                         1
Strandberg, Miss. Ida Sofia                                                           1
Coutts, Master. Eden Leslie "Neville"                                                 1
Hagland, Mr. Konrad Mathias Reiersen                                                  1
Windelov, Mr. Einar                                                                   1
Molson, Mr. Harry Markland                                                            1
Artagaveytia, Mr. Ramon                                                               1
Stanley, Mr. Edward Roland                                                            1
Yousseff, Mr. Gerious                                                                 1
Eustis, Miss. Elizabeth Mussey                                                        1
Shellard, Mr. Frederick William                                                       1
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)                                       1
Svensson, Mr. Olof                                                                    1
Clifford, Mr. George Quincy                                                           1
Jerwan, Mrs. Amin S (Marie Marthe Thuillard)                                          1
Wright, Mr. George                                                                    1
O'Connor, Mr. Maurice                                                                 1
Baclini, Miss. Marie Catherine                                                        1
Peuchen, Major. Arthur Godfrey                                                        1
West, Mr. Edwy Arthur                                                                 1
Hagland, Mr. Ingvald Olai Olsen                                                       1
Foreman, Mr. Benjamin Laventall                                                       1
Goldenberg, Mr. Samuel L                                                              1
Peduzzi, Mr. Joseph                                                                   1
Jalsevac, Mr. Ivan                                                                    1
Millet, Mr. Francis Davis                                                             1
Kenyon, Mrs. Frederick R (Marion)                                                     1
Toomey, Miss. Ellen                                                                   1
Anderson, Mr. Harry                                                                   1
West, Mrs. Edwy Arthur (Ada Mary Worth)                                               1
Morley, Mr. William                                                                   1
Gee, Mr. Arthur H                                                                     1
Milling, Mr. Jacob Christian                                                          1
Maisner, Mr. Simon                                                                    1
Goncalves, Mr. Manuel Estanslas                                                       1
Campbell, Mr. William                                                                 1
Smart, Mr. John Montgomery                                                            1
Scanlan, Mr. James                                                                    1
Baclini, Miss. Helene Barbara                                                         1
Keefe, Mr. Arthur                                                                     1
Cacic, Mr. Luka                                                                       1
Calic, Mr. Petar                                                                      1
Canavan, Miss. Mary                                                                   1
O'Sullivan, Miss. Bridget Mary                                                        1
Andersson, Miss. Sigrid Elisabeth                                                     1
Toufik, Mr. Nakli                                                                     1
Elias, Mr. Joseph Jr                                                                  1
Peter, Mrs. Catherine (Catherine Rizk)                                                1
Cacic, Miss. Marija                                                                   1
Hart, Miss. Eva Miriam                                                                1
Butt, Major. Archibald Willingham                                                     1
LeRoy, Miss. Bertha                                                                   1
Risien, Mr. Samuel Beard                                                              1
Frolicher, Miss. Hedwig Margaritha                                                    1
Crosby, Miss. Harriet R                                                               1
Andersson, Miss. Ingeborg Constanzia                                                  1
Beane, Mr. Edward                                                                     1
Laitinen, Miss. Kristina Sofia                                                        1
Douglas, Mr. Walter Donald                                                            1
Nicholson, Mr. Arthur Ernest                                                          1
Beane, Mrs. Edward (Ethel Clarke)                                                     1
Padro y Manent, Mr. Julian                                                            1
Goldsmith, Mr. Frank John                                                             1
Davies, Master. John Morgan Jr                                                        1
Thayer, Mr. John Borland Jr                                                           1
Sharp, Mr. Percival James R                                                           1
O'Brien, Mr. Timothy                                                                  1
Leeni, Mr. Fahim ("Philip Zenni")                                                     1
Ohman, Miss. Velin                                                                    1
Quick, Miss. Phyllis May                                                              1
Hocking, Mr. Richard George                                                           1
Salonen, Mr. Johan Werner                                                             1
Farthing, Mr. John                                                                    1
Maioni, Miss. Roberta                                                                 1
Penasco y Castellana, Mr. Victor de Satode                                            1
Quick, Mrs. Frederick Charles (Jane Richards)                                         1
Bradley, Mr. George ("George Arthur Brayton")                                         1
Olsen, Mr. Henry Margido                                                              1
Lang, Mr. Fang                                                                        1
Daly, Mr. Eugene Patrick                                                              1
Webber, Mr. James                                                                     1
McGough, Mr. James Robert                                                             1
Rothschild, Mrs. Martin (Elizabeth L. Barrett)                                        1
Coleff, Mr. Satio                                                                     1
Walker, Mr. William Anderson                                                          1
Lemore, Mrs. (Amelia Milley)                                                          1
Ryan, Mr. Patrick                                                                     1
Angle, Mrs. William A (Florence "Mary" Agnes Hughes)                                  1
Pavlovic, Mr. Stefo                                                                   1
Perreault, Miss. Anne                                                                 1
Vovk, Mr. Janko                                                                       1
Lahoud, Mr. Sarkis                                                                    1
Hippach, Mrs. Louis Albert (Ida Sophia Fischer)                                       1
Kassem, Mr. Fared                                                                     1
Farrell, Mr. James                                                                    1
Ridsdale, Miss. Lucy                                                                  1
Rommetvedt, Mr. Knud Paust                                                            1
Taylor, Mrs. Elmer Zebley (Juliet Cummins Wright)                                     1
Mellinger, Miss. Madeleine Violet                                                     1
Lulic, Mr. Nikola                                                                     1
Alexander, Mr. William                                                                1
Lester, Mr. James                                                                     1

In [87]:
print(titanic_df['Pclass'].nunique())
print(titanic_df['Survived'].nunique())
print(titanic_df['Name'].nunique())

3
2
891

### replace로 원본 값을 특정값으로 대체

In [89]:
replace_test_df = pd.read_csv('titanic_train.csv')

In [90]:
replace_test_df.head()

   PassengerId  Survived  Pclass                                                 Name     Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0            1         0       3                              Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0      1      0          PC 17599  71.2833   C85        C
2            3         1       3                               Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
3            4         1       1         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0            113803  53.1000  C123        S
4            5         0       3                             Allen, Mr. William Henry    male  35.0      0      0            373450   8.0500   NaN        S

In [91]:
# Sex의 male값을 Man
replace_test_df['Sex'].replace('male', 'Man')

0         Man
1      female
2      female
3      female
4         Man
5         Man
6         Man
7         Man
8      female
9      female
10     female
11     female
12        Man
13        Man
14     female
15     female
16        Man
17        Man
18     female
19     female
20        Man
21        Man
22     female
23        Man
24     female
25     female
26        Man
27        Man
28     female
29        Man
30        Man
31     female
32     female
33        Man
34        Man
35        Man
36        Man
37        Man
38     female
39     female
40     female
41     female
42        Man
43     female
44     female
45        Man
46        Man
47     female
48        Man
49     female
50        Man
51        Man
52     female
53     female
54        Man
55        Man
56     female
57        Man
58     female
59        Man
60        Man
61     female
62        Man
63        Man
64        Man
65        Man
66     female
67        Man
68     female
69        Man
70        Man
71     female
72        Man
73        Man
74        Man
75        Man
76        Man
77        Man
78        Man
79     female
80        Man
81        Man
82     female
83        Man
84     female
85     female
86        Man
87        Man
88     female
89        Man
90        Man
91        Man
92        Man
93        Man
94        Man
95        Man
96        Man
97        Man
98     female
99        Man
100    female
101       Man
102       Man
103       Man
104       Man
105       Man
106    female
107       Man
108       Man
109    female
110       Man
111    female
112       Man
113    female
114    female
115       Man
116       Man
117       Man
118       Man
119    female
120       Man
121       Man
122       Man
123    female
124       Man
125       Man
126       Man
127       Man
128    female
129       Man
130       Man
131       Man
132    female
133    female
134       Man
135       Man
136    female
137       Man
138       Man
139       Man
140    female
141    female
142    female
143       Man
144       Man
145       Man
146       Man
147    female
148       Man
149       Man
150       Man
151    female
152       Man
153       Man
154       Man
155       Man
156    female
157       Man
158       Man
159       Man
160       Man
161    female
162       Man
163       Man
164       Man
165       Man
166    female
167    female
168       Man
169       Man
170       Man
171       Man
172    female
173       Man
174       Man
175       Man
176       Man
177    female
178       Man
179       Man
180    female
181       Man
182       Man
183       Man
184    female
185       Man
186    female
187       Man
188       Man
189       Man
190    female
191       Man
192    female
193       Man
194    female
195    female
196       Man
197       Man
198    female
199    female
200       Man
201       Man
202       Man
203       Man
204       Man
205    female
206       Man
207       Man
208    female
209       Man
210       Man
211    female
212       Man
213       Man
214       Man
215    female
216    female
217       Man
218    female
219       Man
220       Man
221       Man
222       Man
223       Man
224       Man
225       Man
226       Man
227       Man
228       Man
229    female
230    female
231       Man
232       Man
233    female
234       Man
235    female
236       Man
237    female
238       Man
239       Man
240    female
241    female
242       Man
243       Man
244       Man
245       Man
246    female
247    female
248       Man
249       Man
250       Man
251    female
252       Man
253       Man
254    female
255    female
256    female
257    female
258    female
259    female
260       Man
261       Man
262       Man
263       Man
264    female
265       Man
266       Man
267       Man
268    female
269    female
270       Man
271       Man
272    female
273       Man
274    female
275    female
276    female
277       Man
278       Man
279    female
280       Man
281       Man
282       Man
283       Man
284       Man
285       Man
286       Man
287       Man
288       Man
289    female
290    female
291    female
292       Man
293    female
294       Man
295       Man
296       Man
297    female
298       Man
299    female
300    female
301       Man
302       Man
303    female
304       Man
305       Man
306    female
307    female
308       Man
309    female
310    female
311    female
312    female
313       Man
314       Man
315    female
316    female
317       Man
318    female
319    female
320       Man
321       Man
322    female
323    female
324       Man
325    female
326       Man
327    female
328    female
329    female
330    female
331       Man
332       Man
333       Man
334    female
335       Man
336       Man
337    female
338       Man
339       Man
340       Man
341    female
342       Man
343       Man
344       Man
345    female
346    female
347    female
348       Man
349       Man
350       Man
351       Man
352       Man
353       Man
354       Man
355       Man
356    female
357    female
358    female
359    female
360       Man
361       Man
362    female
363       Man
364       Man
365       Man
366    female
367    female
368    female
369    female
370       Man
371       Man
372       Man
373       Man
374    female
375    female
376    female
377       Man
378       Man
379       Man
380    female
381    female
382       Man
383    female
384       Man
385       Man
386       Man
387    female
388       Man
389    female
390       Man
391       Man
392       Man
393    female
394    female
395       Man
396    female
397       Man
398       Man
399    female
400       Man
401       Man
402    female
403       Man
404    female
405       Man
406       Man
407       Man
408       Man
409    female
410       Man
411       Man
412    female
413       Man
414       Man
415    female
416    female
417    female
418       Man
419    female
420       Man
421       Man
422       Man
423    female
424       Man
425       Man
426    female
427    female
428       Man
429       Man
430       Man
431    female
432    female
433       Man
434       Man
435    female
436    female
437    female
438       Man
439       Man
440    female
441       Man
442       Man
443    female
444       Man
445       Man
446    female
447       Man
448    female
449       Man
450       Man
451       Man
452       Man
453       Man
454       Man
455       Man
456       Man
457    female
458    female
459       Man
460       Man
461       Man
462       Man
463       Man
464       Man
465       Man
466       Man
467       Man
468       Man
469    female
470       Man
471       Man
472    female
473    female
474    female
475       Man
476       Man
477       Man
478       Man
479    female
480       Man
481       Man
482       Man
483    female
484       Man
485    female
486    female
487       Man
488       Man
489       Man
490       Man
491       Man
492       Man
493       Man
494       Man
495       Man
496    female
497       Man
498    female
499       Man
500       Man
501    female
502    female
503    female
504    female
505       Man
506    female
507       Man
508       Man
509       Man
510       Man
511       Man
512       Man
513    female
514       Man
515       Man
516    female
517       Man
518    female
519       Man
520    female
521       Man
522       Man
523    female
524       Man
525       Man
526    female
527       Man
528       Man
529       Man
530    female
531       Man
532       Man
533    female
534    female
535    female
536       Man
537    female
538       Man
539    female
540    female
541    female
542    female
543       Man
544       Man
545       Man
546    female
547       Man
548       Man
549       Man
550       Man
551       Man
552       Man
553       Man
554    female
555       Man
556    female
557       Man
558    female
559    female
560       Man
561       Man
562       Man
563       Man
564    female
565       Man
566       Man
567    female
568       Man
569       Man
570       Man
571    female
572       Man
573    female
574       Man
575       Man
576    female
577    female
578    female
579       Man
580    female
581    female
582       Man
583       Man
584       Man
585    female
586       Man
587       Man
588       Man
589       Man
590       Man
591    female
592       Man
593    female
594       Man
595       Man
596    female
597       Man
598       Man
599       Man
600    female
601       Man
602       Man
603       Man
604       Man
605       Man
606       Man
607       Man
608    female
609    female
610    female
611       Man
612    female
613       Man
614       Man
615    female
616       Man
617    female
618    female
619       Man
620       Man
621       Man
622       Man
623       Man
624       Man
625       Man
626       Man
627    female
628       Man
629       Man
630       Man
631       Man
632       Man
633       Man
634    female
635    female
636       Man
637       Man
638    female
639       Man
640       Man
641    female
642    female
643       Man
644    female
645       Man
646       Man
647       Man
648       Man
649    female
650       Man
651    female
652       Man
653    female
654    female
655       Man
656       Man
657    female
658       Man
659       Man
660       Man
661       Man
662       Man
663       Man
664       Man
665       Man
666       Man
667       Man
668       Man
669    female
670    female
671       Man
672       Man
673       Man
674       Man
675       Man
676       Man
677    female
678    female
679       Man
680    female
681       Man
682       Man
683       Man
684       Man
685       Man
686       Man
687       Man
688       Man
689    female
690       Man
691    female
692       Man
693       Man
694       Man
695       Man
696       Man
697    female
698       Man
699       Man
700    female
701       Man
702    female
703       Man
704       Man
705       Man
706    female
707       Man
708    female
709       Man
710    female
711       Man
712       Man
713       Man
714       Man
715       Man
716    female
717    female
718       Man
719       Man
720    female
721       Man
722       Man
723       Man
724       Man
725       Man
726    female
727    female
728       Man
729    female
730    female
731       Man
732       Man
733       Man
734       Man
735       Man
736    female
737       Man
738       Man
739       Man
740       Man
741       Man
742    female
743       Man
744       Man
745       Man
746       Man
747    female
748       Man
749       Man
750    female
751       Man
752       Man
753       Man
754    female
755       Man
756       Man
757       Man
758       Man
759    female
760       Man
761       Man
762       Man
763    female
764       Man
765    female
766       Man
767    female
768       Man
769       Man
770       Man
771       Man
772    female
773       Man
774    female
775       Man
776       Man
777    female
778       Man
779    female
780    female
781    female
782       Man
783       Man
784       Man
785       Man
786    female
787       Man
788       Man
789       Man
790       Man
791       Man
792    female
793       Man
794       Man
795       Man
796    female
797    female
798       Man
799    female
800       Man
801    female
802       Man
803       Man
804       Man
805       Man
806       Man
807    female
808       Man
809    female
810       Man
811       Man
812       Man
813    female
814       Man
815       Man
816    female
817       Man
818       Man
819       Man
820    female
821       Man
822       Man
823    female
824       Man
825       Man
826       Man
827       Man
828       Man
829    female
830    female
831       Man
832       Man
833       Man
834       Man
835    female
836       Man
837       Man
838       Man
839       Man
840       Man
841       Man
842    female
843       Man
844       Man
845       Man
846       Man
847       Man
848       Man
849    female
850       Man
851       Man
852    female
853    female
854    female
855    female
856    female
857       Man
858    female
859       Man
860       Man
861       Man
862    female
863    female
864       Man
865    female
866    female
867       Man
868       Man
869       Man
870       Man
871    female
872       Man
873       Man
874    female
875    female
876       Man
877       Man
878       Man
879    female
880    female
881       Man
882    female
883       Man
884       Man
885    female
886       Man
887    female
888    female
889       Man
890       Man
Name: Sex, dtype: object

In [92]:
replace_test_df['Sex'] = replace_test_df['Sex'].replace({'male':'Man', 'female':'Woman'})

In [95]:
replace_test_df['Cabin'] = replace_test_df['Cabin'].replace(np.nan, 'C001')

In [96]:
replace_test_df['Cabin'].value_counts(dropna=False)

C001               687
C23 C25 C27          4
G6                   4
B96 B98              4
C22 C26              3
D                    3
F33                  3
E101                 3
F2                   3
B20                  2
E67                  2
C125                 2
E24                  2
B49                  2
B77                  2
D35                  2
C78                  2
C93                  2
C65                  2
B57 B59 B63 B66      2
B5                   2
E121                 2
B51 B53 B55          2
B18                  2
C124                 2
C126                 2
B35                  2
E44                  2
C92                  2
C68                  2
D20                  2
B22                  2
E25                  2
D36                  2
E8                   2
C83                  2
C2                   2
D17                  2
D26                  2
D33                  2
F G73                2
E33                  2
B28                  2
C52                  2
C123                 2
F4                   2
B58 B60              2
A23                  1
D9                   1
A20                  1
D50                  1
D28                  1
D19                  1
C47                  1
E17                  1
B41                  1
A26                  1
E68                  1
A10                  1
A24                  1
C101                 1
A16                  1
C70                  1
C86                  1
C50                  1
B42                  1
B39                  1
B50                  1
D11                  1
D48                  1
C90                  1
C46                  1
D45                  1
E77                  1
F38                  1
B3                   1
B101                 1
C95                  1
D6                   1
C45                  1
B82 B84              1
E58                  1
C62 C64              1
A36                  1
F G63                1
B102                 1
B69                  1
E49                  1
D49                  1
B71                  1
D30                  1
B38                  1
E10                  1
B73                  1
B86                  1
C99                  1
B94                  1
C87                  1
D15                  1
A31                  1
B80                  1
B4                   1
A32                  1
C49                  1
A7                   1
B19                  1
D47                  1
D7                   1
F E69                1
C110                 1
D10 D12              1
A5                   1
E31                  1
B30                  1
B78                  1
A6                   1
D56                  1
C103                 1
E46                  1
C118                 1
A19                  1
D46                  1
C85                  1
B79                  1
C30                  1
B37                  1
A14                  1
E63                  1
E12                  1
D21                  1
E38                  1
C111                 1
C104                 1
A34                  1
C82                  1
C106                 1
E50                  1
D37                  1
C128                 1
T                    1
E40                  1
C91                  1
C32                  1
E34                  1
C7                   1
C54                  1
E36                  1
C148                 1
Name: Cabin, dtype: int64

### apply lambda 식으로 데이터 가공

In [ ]:
def get_square(a):
    return a**2

print('3의 제곱은:',get_square(3))

In [ ]:
lambda_square = lambda x : x ** 2
print('3의 제곱은:',lambda_square(3))

In [ ]:
a=[1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

In [ ]:
titanic_df['Name_len']= titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name','Name_len']].head(3)

In [ ]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x <=15 else 'Adult' )
titanic_df[['Age','Child_Adult']].head(8)

In [ ]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x <= 60 else 
                                                                                  'Elderly'))
titanic_df['Age_cat'].value_counts()

In [ ]:
# 나이에 따라 세분화된 분류를 수행하는 함수 생성. 
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else : cat = 'Elderly'
    
    return cat

# lambda 식에 위에서 생성한 get_category( ) 함수를 반환값으로 지정. 
# get_category(X)는 입력값으로 ‘Age’ 칼럼 값을 받아서 해당하는 cat 반환
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age','Age_cat']].head()